In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = [{'a': i, 'b':100* i}for i in range(10)]
print(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 100}, {'a': 2, 'b': 200}, {'a': 3, 'b': 300}, {'a': 4, 'b': 400}, {'a': 5, 'b': 500}, {'a': 6, 'b': 600}, {'a': 7, 'b': 700}, {'a': 8, 'b': 800}, {'a': 9, 'b': 900}]

In [4]:
pd.DataFrame(data)

   a    b
0  0    0
1  1  100
2  2  200
3  3  300
4  4  400
5  5  500
6  6  600
7  7  700
8  8  800
9  9  900

In [8]:
#printing tables as a data frame

dat1 = [{'a': i, 'b':10+ i,'c':20+i,'d':30+i,'e':40+i,'f':50+i}for i in range(11)]       
print(dat1)

[{'a': 0, 'b': 10, 'c': 20, 'd': 30, 'e': 40, 'f': 50}, {'a': 1, 'b': 11, 'c': 21, 'd': 31, 'e': 41, 'f': 51}, {'a': 2, 'b': 12, 'c': 22, 'd': 32, 'e': 42, 'f': 52}, {'a': 3, 'b': 13, 'c': 23, 'd': 33, 'e': 43, 'f': 53}, {'a': 4, 'b': 14, 'c': 24, 'd': 34, 'e': 44, 'f': 54}, {'a': 5, 'b': 15, 'c': 25, 'd': 35, 'e': 45, 'f': 55}, {'a': 6, 'b': 16, 'c': 26, 'd': 36, 'e': 46, 'f': 56}, {'a': 7, 'b': 17, 'c': 27, 'd': 37, 'e': 47, 'f': 57}, {'a': 8, 'b': 18, 'c': 28, 'd': 38, 'e': 48, 'f': 58}, {'a': 9, 'b': 19, 'c': 29, 'd': 39, 'e': 49, 'f': 59}, {'a': 10, 'b': 20, 'c': 30, 'd': 40, 'e': 50, 'f': 60}]

In [9]:
pd.DataFrame(dat1)

     a   b   c   d   e   f
0    0  10  20  30  40  50
1    1  11  21  31  41  51
2    2  12  22  32  42  52
3    3  13  23  33  43  53
4    4  14  24  34  44  54
5    5  15  25  35  45  55
6    6  16  26  36  46  56
7    7  17  27  37  47  57
8    8  18  28  38  48  58
9    9  19  29  39  49  59
10  10  20  30  40  50  60

In [12]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [15]:
pd.DataFrame([{'maths':90,'phy':80,'chem':94,'comp_science':85},{'maths':50,'phy':66,'chem':70,},
              {'maths':80,'chem':84,'comp_science':90},{'phy':88,'chem':74,'comp_science':100}])

   maths   phy  chem  comp_science
0   90.0  80.0    94          85.0
1   50.0  66.0    70           NaN
2   80.0   NaN    84          90.0
3    NaN  88.0    74         100.0

In [16]:
n=np.random.randint(2, 20)

In [17]:
n

18

In [18]:
print(n)

18

In [26]:
pd.DataFrame(np.random.randint(2, 20),
             columns=['a', 'b','c'],
             index=['x', 'y', 'z'])

    a   b   c
x  17  17  17
y  17  17  17
z  17  17  17

In [22]:
help(np.random.randint)

Help on built-in function randint:

randint(...) method of numpy.random.mtrand.RandomState instance
    randint(low, high=None, size=None, dtype='l')

    Return random integers from `low` (inclusive) to `high` (exclusive).

    Return random integers from the "discrete uniform" distribution of
    the specified dtype in the "half-open" interval [`low`, `high`). If
    `high` is None (the default), then results are from [0, `low`).

    .. note::
        New code should use the ``integers`` method of a ``default_rng()``
        instance instead; see `random-quick-start`.

    Parameters
    ----------
    low : int or array-like of ints
        Lowest (signed) integers to be drawn from the distribution (unless
        ``high=None``, in which case this parameter is one above the
        *highest* such integer).
    high : int or array-like of ints, optional
        If provided, one above the largest (signed) integer to be drawn
        from the distribution (see above for behavior if ``high=None``).
        If array-like, must contain integer values
    size : int or tuple of ints, optional
        Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
        ``m * n * k`` samples are drawn.  Default is None, in which case a
        single value is returned.
    dtype : dtype, optional
        Desired dtype of the result. All dtypes are determined by their
        name, i.e., 'int64', 'int', etc, so byteorder is not available
        and a specific precision may have different C types depending
        on the platform. The default value is `np.int_`.

        .. versionadded:: 1.11.0

    Returns
    -------
    out : int or ndarray of ints
        `size`-shaped array of random integers from the appropriate
        distribution, or a single such random int if `size` not provided.

    See Also
    --------
    random_integers : similar to `randint`, only for the closed
        interval [`low`, `high`], and 1 is the lowest value if `high` is
        omitted.
    Generator.integers: which should be used for new code.

    Examples
    --------
    >>> np.random.randint(2, size=10)
    array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
    >>> np.random.randint(1, size=10)
    array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

    Generate a 2 x 4 array of ints between 0 and 4, inclusive:

    >>> np.random.randint(5, size=(2, 4))
    array([[4, 0, 2, 1], # random
           [3, 2, 2, 0]])

    Generate a 1 x 3 array with 3 different upper bounds

    >>> np.random.randint(1, [3, 5, 10])
    array([2, 2, 9]) # random

    Generate a 1 by 3 array with 3 different lower bounds

    >>> np.random.randint([1, 5, 7], 10)
    array([9, 8, 7]) # random

    Generate a 2 by 4 array using broadcasting with dtype of uint8

    >>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
    array([[ 8,  6,  9,  7], # random
           [ 1, 16,  9, 12]], dtype=uint8)

In [31]:
pd.DataFrame(np.random.randint(2, 20),
             columns=['a', 'b','c','d'],
             index=['w','x', 'y', 'z'])

    a   b   c   d
w  17  17  17  17
x  17  17  17  17
y  17  17  17  17
z  17  17  17  17

In [40]:
i=pd.Index([1,2,3,4,5,6,7,8,9])

In [41]:
i

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [42]:
i[::-1]   #printing the reverse index

Int64Index([9, 8, 7, 6, 5, 4, 3, 2, 1], dtype='int64')

In [43]:
i[1:5]

Int64Index([2, 3, 4, 5], dtype='int64')

In [44]:
print(i.size, i.shape, i.ndim)

9 (9,) 1

In [45]:
ind[0] = 0

NameError: name 'ind' is not defined

In [53]:
rng = np.random.RandomState(10)

In [54]:
rng

RandomState(MT19937) at 0x14487F7B158

In [61]:
s = pd.Series(rng.randint(1, 20, 4))
s

0    12
1     2
2     9
3     5
dtype: int32

In [63]:
d = pd.DataFrame(rng.randint(0, 10, (5, 4)))

In [64]:
d

   0  1  2  3
0  7  8  1  7
1  1  4  0  8
2  5  4  7  8
3  8  2  6  2
4  8  8  6  6

In [69]:
d = pd.DataFrame(rng.randint(0, 10, (4, 4)),
                  columns=['A', 'B', 'C', 'D'])

In [70]:
d

   A  B  C  D
0  5  6  0  0
1  6  9  1  8
2  9  1  2  8
3  9  9  5  0

In [71]:
d = pd.DataFrame(rng.randint(0, 10, (4, 4)),
                  columns=['A', 'B', 'C', 'D'],
                   index=['w','x','y','z'])

In [72]:
d

   A  B  C  D
w  2  7  3  0
x  4  2  0  3
y  3  1  2  5
z  9  0  1  0

In [74]:
d.name='random'
d.index.name='numpy generated func'

In [75]:
d

                      A  B  C  D
numpy generated func
w                     2  7  3  0
x                     4  2  0  3
y                     3  1  2  5
z                     9  0  1  0

In [81]:
c=pd.DataFrame([1000000,2500000,3650000,4950000,9900000],
               index=['gangavathi','hospete','hubli','belgaum','bangalore',])

In [82]:
c

                  0
gangavathi  1000000
hospete     2500000
hubli       3650000
belgaum     4950000
bangalore   9900000

In [83]:
c.name='population'
c.index.name='cities'

In [84]:
c

                  0
cities
gangavathi  1000000
hospete     2500000
hubli       3650000
belgaum     4950000
bangalore   9900000

In [85]:
np.log(c)

                    0
cities
gangavathi  13.815511
hospete     14.731801
hubli       15.110238
belgaum     15.414898
bangalore   16.108045

In [86]:
np.sin(d * np.pi / 5)

                             A         B         C             D
numpy generated func
w                     0.951057 -0.951057  0.951057  0.000000e+00
x                     0.587785  0.951057  0.000000  9.510565e-01
y                     0.951057  0.587785  0.951057  1.224647e-16
z                    -0.587785  0.000000  0.587785  0.000000e+00

In [88]:
c=pd.Series([1000000,2500000,3650000,4950000,9900000],
               index=['gangavathi','hospete','hubli','belgaum','bangalore',])
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')

In [89]:
print(area)
c

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

gangavathi    1000000
hospete       2500000
hubli         3650000
belgaum       4950000
bangalore     9900000
dtype: int64

In [90]:
area/c

Alaska       NaN
California   NaN
Texas        NaN
bangalore    NaN
belgaum      NaN
gangavathi   NaN
hospete      NaN
hubli        NaN
dtype: float64

In [94]:
c=pd.Series([1000000,2500000,3650000,4950000,9900000],
               index=['gangavathi','hospete','hubli','belgaum','bangalore',])
area = pd.Series({'gangavathi': 1723337, 'hubli': 695662,
                  'bagalkot': 423967}, name='area')

In [95]:
c/area

bagalkot           NaN
bangalore          NaN
belgaum            NaN
gangavathi    0.580270
hospete            NaN
hubli         5.246801
dtype: float64

In [96]:
area.index | c.index

Index(['bagalkot', 'bangalore', 'belgaum', 'gangavathi', 'hospete', 'hubli'], dtype='object')

In [98]:
A = pd.Series([1,4,5,7], index=[0, 1, 2, 3])
B = pd.Series([1,6,10 ], index=[1, 2, 3])

In [99]:
print(A)
print(B)

0    1
1    4
2    5
3    7
dtype: int64
1     1
2     6
3    10
dtype: int64

In [100]:
A + B

0     NaN
1     5.0
2    11.0
3    17.0
dtype: float64

In [105]:
A.add(B, fill_value=0)

0     1.0
1     5.0
2    11.0
3    17.0
dtype: float64

In [106]:
c = pd.Series([1,2,3,4], index=[0, 1, 2, 3])
d = pd.Series([10,10,10,10,10], index=[1, 2, 3, 4, 5])

In [107]:
print(c)

0    1
1    2
2    3
3    4
dtype: int64

In [108]:
print(d)

1    10
2    10
3    10
4    10
5    10
dtype: int64

In [109]:
c+d

0     NaN
1    12.0
2    13.0
3    14.0
4     NaN
5     NaN
dtype: float64

In [110]:
d.add(c,fill_value=10)

0    11.0
1    12.0
2    13.0
3    14.0
4    20.0
5    20.0
dtype: float64

In [111]:
f={'marks':[70,95,89,85,100],
   'subject':['lang1','maths','physics','chemistry','comp_science'], 
    'result':['p','p','p','p','p'],
    'grades':['C','A','B','B','A']}
f_data=pd.DataFrame(f)

In [113]:
f_data

   marks       subject result grades
0     70         lang1      p      C
1     95         maths      p      A
2     89       physics      p      B
3     85     chemistry      p      B
4    100  comp_science      p      A

In [117]:
f1 = pd.DataFrame({'subject':['lang1','maths','physics','chemistry','comp_science'], "points":f_data.marks/100})

In [118]:
f1

        subject  points
0         lang1    0.70
1         maths    0.95
2       physics    0.89
3     chemistry    0.85
4  comp_science    1.00

In [119]:
f_data.merge(f1)

   marks       subject result grades  points
0     70         lang1      p      C    0.70
1     95         maths      p      A    0.95
2     89       physics      p      B    0.89
3     85     chemistry      p      B    0.85
4    100  comp_science      p      A    1.00

In [120]:
f2 = pd.DataFrame({'Subject':['lang1','maths','physics','chemistry','comp_science'],
                   "points":f_data.marks/100})
f_data.merge(f2, right_on='Subject', left_on='subject')

   marks       subject result grades       Subject  points
0     70         lang1      p      C         lang1    0.70
1     95         maths      p      A         maths    0.95
2     89       physics      p      B       physics    0.89
3     85     chemistry      p      B     chemistry    0.85
4    100  comp_science      p      A  comp_science    1.00

In [122]:
f3 = pd.DataFrame({'subject':['lang1','maths','physics','chemistry','comp_science'],
                   "points":f_data.marks/100})
f_data.merge(f3, how='outer')

   marks       subject result grades  points
0     70         lang1      p      C    0.70
1     95         maths      p      A    0.95
2     89       physics      p      B    0.89
3     85     chemistry      p      B    0.85
4    100  comp_science      p      A    1.00

In [123]:
a = pd.Series([1.5, np.nan, 3.5, np.nan, np.nan],
                     index=['a', 'b', 'c', 'd', 'e'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
                 index=['a', 'b', 'c', 'd', 'e'])

In [124]:
print(a)
print(b)

a    1.5
b    NaN
c    3.5
d    NaN
e    NaN
dtype: float64
a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [125]:
pd.Series(np.where(pd.isnull(a), b, a), index=a.index)

a    1.5
b    1.0
c    3.5
d    3.0
e    4.0
dtype: float64

In [126]:
a.combine_first(b)

a    1.5
b    1.0
c    3.5
d    3.0
e    4.0
dtype: float64